Repository: AlickH/Swiftier
Catalog: Swiftier/Localizable.xcstrings
Source language: zh_hans
Languages: en

source: f
en: P2P

source: GitHub 仓库
en: GitHub Repo

source: SOCKS5 服务器
en: SOCKS5 Proxy

source: Swiftier 已是最新版本
en: Swiftier is up to date

source: Swiftier 应该已自动出现在列表中
en: 2. Swiftier should be in the list

source: TCP NAT 类型
en: TCP NAT Type

source: UDP NAT 类型
en: UDP NAT Type

source: VPN 门户配置
en: VPN Portal

source: 一对一
en: No PAT

source: 下一跳 (延迟优先)
en: Next Hop (Latency First)

source: 下一跳 ID
en: Next Hop ID

source: 不使用 TUN 网卡，适合无管理员权限时使用。本节点仅允许被访问。访问其他节点需要使用 SOCKS5。
en: SOCKS5 access only.

source: 丢包
en: Loss

source: 丢包率
en: Loss Rate

source: 中转
en: Relay

source: 为了能够读取您选择的任意文件夹及配置文件，Swiftier 需要“完全磁盘访问权限”。 这不会泄露您的私有数据，仅用于解除系统文件夹读取限制。
en: Swiftier needs Full Disk Access to read your config folders. Your private data is never accessed.

source: 主机名
en: Hostname

source: 主机名称
en: Hostname

source: 交互事件
en: Events

source: 仅 P2P
en: P2P Only

source: 仅与已经建立 P2P 连接的对等节点通信，不通过其他节点中转。
en: No indirect relay.

source: 仅使用物理网卡
en: Physical Only

source: 仅使用物理网卡，避免 EasyTier 通过其他虚拟网建立连接。
en: Avoid virtual NICs.

source: 仅保留 Helper 加速启动
en: Keep Helper

source: 仅转发白名单网络的流量，支持通配符字符串。多个网络名称间可以使用英文空格间隔。如果该参数为空，则禁用转发。默认允许所有网络。例如：* (所有网络), def* (以 def 为前缀的网络), net1 net2 (只允许 net1 和 net2)。
en: Forward only for whitelisted networks using space-separated names and wildcards. Empty means all blocked, * means all allowed.

source: 代价
en: Cost

source: 代价 (延迟优先)
en: Cost (Latency First)

source: 代理：
en: Proxy:

source: 代理网段
en: Proxy CIDRs

source: 以后再说
en: Not Now

source: 使用多线程运行时。
en: Multi-threaded cores.

source: 使用用户态 TCP/IP 协议栈，避免操作系统防火墙问题导致无法子网代理 / KCP 代理。
en: Avoid Firewall issues.

source: 使用用户态协议栈
en: User-stack

source: 例如: my-network
en: e.g. my-network

source: 保存
en: Save

source: 保持连接运行
en: Keep Connecting

source: 修改日志等级后，需要停止并重新启动服务才能生效。
en: Effective after restart.

source: 允许此节点成为出口节点。
en: Node is an exit.

source: 允许转发所有对等节点的 RPC 数据包，即使对等节点不在转发网络白名单中。这可以帮助白名单外网络中的对等节点建立 P2P 连接。
en: Forward RPC for all.

source: 全部
en: All

source: 全锥形
en: Full Cone

source: 公共服务器
en: Public

source: 关于
en: About

source: 关闭
en: Close

source: 出口节点列表
en: Exit Nodes

source: 创建
en: Create

source: 创建新网络
en: Create New Network

source: 删除
en: Delete

source: 删除选中的配置
en: Delete Selected Config

source: 前往下载
en: Get Update

source: 功能开关
en: Functions

source: 协议
en: Protocol

source: 去开启
en: Enable

source: 发送
en: Sent

source: 取消
en: Cancel

source: 受限
en: Restricted

source: 只需打开旁边的开关即可
en: 3. Simply turn on the toggle

source: 名称
en: Name

source: 启动 APP 时自动连接
en: Connect on Launch

source: 启用
en: Enable

source: 启用 KCP 代理
en: Enable KCP

source: 启用 Magic DNS
en: Magic DNS

source: 启用 QUIC 代理
en: Enable QUIC

source: 启用出口节点
en: Enable Exit

source: 启用多线程
en: Multi-thread

source: 启用私有模式
en: Private Node

source: 启用私有模式，则不允许使用了与本网络不同的网络名称和密码的节点通过本节点进行握手或中转。
en: Allow same creds only.

source: 启用魔法 DNS，允许通过 EasyTier 的 DNS 服务器访问其他节点的虚拟 IPv4 地址，例如：node1.et.net。
en: Access by node name.

source: 在 Finder 中打开
en: Open in Finder

source: 在 Finder 中显示
en: Show in Finder

source: 在此打开
en: Open Here

source: 地址
en: Address

source: 基础信息
en: Info

source: 存储到 iCloud
en: Store in iCloud

source: 安装并自启
en: Install & Relaunch

source: 完全磁盘访问权限
en: Full Disk Access

source: 完全退出
en: Quit Program

source: 完成
en: Done

source: 实例 ID
en: Instance ID

source: 客户端网段
en: Client CIDR

source: 密码
en: Password

source: 对称
en: Symmetric

source: 将 TCP 流量转为 KCP 流量，降低传输延迟，提升传输速度。
en: KCP for low latency.

source: 将 TCP 流量转为 QUIC 流量，降低传输延迟，提升传输速度。
en: QUIC for low latency.

source: 将自动添加 .toml 后缀
en: Suffix .toml will be added

source: 已开启
en: Enabled

source: 延迟
en: Ping

source: 延迟优先模式
en: Lowest Latency

source: 开发者
en: Developer

source: 开启 SOCKS5 代理功能，Surge 等外部程序可通过此端口连接 EasyTier 网络。
en: Enable SOCKS5 proxy so external apps like Surge can connect to the EasyTier network.

source: 开放
en: Open

source: 开机自动启动
en: Launch at Login

source: 开源声明
en: Licenses

source: 忽略中转跳数，选择总延迟最低的路径。
en: Ignore hops, pick best path.

source: 手动
en: Manual

source: 手动分配路由 CIDR，将禁用子网代理和从对等节点传播的 wireguard路由。例如：192.168.0.0/16
en: Assign route CIDRs manually. This disables subnet proxying and Wireguard route propagation.

source: 手动指定监听器的公网地址，其他节点可以使用该地址连接到本节点。例如：tcp://123.123.123.123:11223，可以指定多个。
en: Manually specify public addresses for listeners so other peers can connect directly.

source: 接收
en: Received

source: 接收 Beta 版本
en: Join Beta

source: 无 TUN 模式
en: No-TUN

source: 日志
en: Logs

source: 日志等级
en: Log Level

source: 暂无交互事件
en: No Events

source: 有新版本可用
en: Update Avail

source: 服务器
en: Server

source: 未发现配置
en: No Configs

source: 未知节点
en: Unknown Peer

source: 本地地址
en: Local Addr

source: 本机
en: Host

source: 本节点
en: This Node

source: 本项目遵循 MIT 开源许可证。
en: MIT Licensed.

source: 查看文件
en: Show File

source: 检查失败
en: Check Failed

source: 检查更新
en: Check Update

source: 正在检查...
en: Checking...

source: 添加
en: Add

source: 添加 DNS
en: Add DNS

source: 添加代理网段
en: Add Proxy

source: 添加出口节点
en: Add Exit

source: 添加监听地址
en: Add Addr

source: 添加端口转发
en: Add Port

source: 添加节点
en: Add Peer

source: 添加路由
en: Add Route

source: 源代码
en: Source Code

source: 点击“去开启”，进入系统设置
en: 1. Click Enable to open System Settings

source: 点击条目以复制内容
en: Click an item to copy

source: 版本
en: Version

source: 特性标志
en: Features

source: 独立
en: Standalone

source: 生成
en: Generate

source: 监听 %lld
en: Listener %lld

source: 监听地址
en: Bind Addrs

source: 监听映射
en: Listener Map

source: 监听端口
en: Listen Port

source: 目标地址
en: Destination

source: 直连
en: P2P

source: 禁用 IPv6
en: Disable IPv6

source: 禁用 KCP 入站流量，其他开启 KCP 代理的节点仍然使用 TCP 连接到本节点。
en: Reject incoming KCP.

source: 禁用 KCP 输入
en: Block KCP In

source: 禁用 P2P
en: Force Relay

source: 禁用 P2P 模式，所有流量通过手动指定的服务器中转。
en: Disable P2P mode.

source: 禁用 QUIC 入站流量，其他开启 QUIC 代理的节点仍然使用 TCP 连接到本节点。
en: Reject incoming QUIC.

source: 禁用 QUIC 输入
en: Block QUIC In

source: 禁用 UDP 打洞
en: Skip Punch

source: 禁用 UDP 打洞功能。
en: Skip UDP punching.

source: 禁用加密
en: Cleartext

source: 禁用对标 NAT 的打洞 (生日攻击)，将对称 NAT 视为锥形 NAT 处理。
en: Assume Cone NAT.

source: 禁用对称 NAT 打洞
en: Skip Sym Punch

source: 禁用对等节点通信的加密，默认为 false，必须与对等节点相同。
en: No packet encryption.

source: 禁用此节点的 IPv6 功能，仅使用 IPv4 进行网络通信。
en: Only use IPv4.

source: 稍后
en: Later

source: 立即下载
en: Download Now

source: 立即去开启
en: Enable Now

source: 端口受限
en: Port Restricted

source: 端口转发
en: Forwarding

source: 系统转发
en: Kernel Fwd

source: 绑定地址
en: Bind Addr

source: 编辑配置
en: Edit Config

source: 编辑配置为文件
en: Edit as File

source: 网络
en: Network

source: 网络信息
en: Networking

source: 网络白名单
en: Whitelist

source: 联系邮箱
en: Support Email

source: 自动更新
en: Auto Update

source: 自定义路由
en: Static Routes

source: 节点
en: Node

source: 节点 ID
en: Peer ID

source: 节点：
en: Peer:

source: 节点加载中
en: Loading...

source: 节点模式
en: Node Mode

source: 虚拟 IP
en: Virtual IP

source: 虚拟 IPv4 地址
en: Virtual IP

source: 覆盖 DNS
en: Override DNS

source: 覆盖系统 DNS。如果也同时启用了魔法 DNS，需要手动添加。
en: Override system DNS. (Magic DNS manual add).

source: 角色
en: Role

source: 设置
en: Settings

source: 请选择配置
en: Select Config

source: 调试日志
en: Full Logs

source: 路径延迟
en: Path Latency

source: 路径延迟 (延迟优先)
en: Path Latency (Latency First)

source: 路由：
en: Route:

source: 转发 RPC 包
en: Relay RPC

source: 转发到
en: Fwd To

source: 转发所有流量的出口节点，虚拟 IPv4 地址，优先级由列表顺序决定。
en: Virtual IPv4 addresses for exit nodes. Traffic is forwarded based on the order of the list.

source: 返回
en: Back

source: 远程地址
en: Remote Addr

source: 连接 %lld [%@]
en: Conn %lld [%@]

source: 连接时图标呼吸闪烁
en: Blinking Icon

source: 连接状态
en: Status

source: 退出 APP 时
en: On App Exit

source: 选填
en: Optional

source: 选择文件夹
en: Select Folder

source: 通用
en: General

source: 通过系统内核转发子网代理数据包，禁用内置 NAT。
en: No built-in NAT.

source: 通过系统控制台中打开完整日志
en: Open Console Logs

source: 配置文件
en: Configs

source: 配置文件名:
en: Config Filename:

source: 配置生成器
en: Config Tool

source: 重新生成 UUID
en: Regen ID

source: 隐私
en: Privacy

source: 隧道方式
en: Relay Mode

source: 需要完全磁盘访问权限
en: Full Disk Access Required

source: 高级设置
en: Advanced

source: 默认
en: Default

source: 默认连接
en: Default Conn
